app/controllers/trips_controller.rb

  def index
    @trips = Trip.all
---
SELECT "trips".* FROM "trips"

  def show
    @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    if Trip.create!(trip_params)
---
INSERT INTO "trips" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "asdf"], ["description", "asdf"], ["created_at", 2017-07-06 00:27:05 UTC], ["updated_at", 2017-07-06 00:27:05 UTC]]